IDENTIFICATION DIVISION.
PROGRAM-ID. COBOL-SDL.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. UNIX-LINUX.
OBJECT-COMPUTER. WASM.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
PROCEDURE DIVISION.
MAIN SECTION.
ENTRY 'MAIN'.
        DISPLAY "HELLO WORLD!"
        GOBACK.
