IDENTIFICATION DIVISION.
PROGRAM-ID. COBOL-SDL.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. UNIX-LINUX.
OBJECT-COMPUTER. WASM.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
01 WS-BLOB PIC X(100000).
01 WS-BLOB-SIZE PIC 9(10).
PROCEDURE DIVISION.
MAIN SECTION.
ENTRY 'MAIN'.
DISPLAY "HELLO WORLD!"
        CALL 'cobdom_set_and_start_main_loop' USING 'RENDER'.
        GOBACK.
RENDER SECTION.
ENTRY 'RENDER'.
        DISPLAY "Rendering?".
        GOBACK.
